/* automatically generated by rust-bindgen 0.59.1 */

pub type __useconds_t = ::std::os::raw::c_uint;
pub type XID = ::std::os::raw::c_ulong;
pub type Atom = ::std::os::raw::c_ulong;
pub type VisualID = ::std::os::raw::c_ulong;
pub type Window = XID;
pub type Colormap = XID;
pub type KeySym = XID;
pub type KeyCode = ::std::os::raw::c_uchar;
pub type wchar_t = ::std::os::raw::c_int;
pub type XPointer = *mut ::std::os::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XExtData {
    pub number: ::std::os::raw::c_int,
    pub next: *mut _XExtData,
    pub free_private: ::std::option::Option<
        unsafe extern "C" fn(extension: *mut _XExtData) -> ::std::os::raw::c_int,
    >,
    pub private_data: XPointer,
}
#[test]
fn bindgen_test_layout__XExtData() {
    assert_eq!(
        ::std::mem::size_of::<_XExtData>(),
        32usize,
        concat!("Size of: ", stringify!(_XExtData))
    );
    assert_eq!(
        ::std::mem::align_of::<_XExtData>(),
        8usize,
        concat!("Alignment of ", stringify!(_XExtData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_XExtData>())).number as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_XExtData),
            "::",
            stringify!(number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_XExtData>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_XExtData),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_XExtData>())).free_private as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_XExtData),
            "::",
            stringify!(free_private)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_XExtData>())).private_data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_XExtData),
            "::",
            stringify!(private_data)
        )
    );
}
pub type XExtData = _XExtData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XGC {
    _unused: [u8; 0],
}
pub type GC = *mut _XGC;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Visual {
    pub ext_data: *mut XExtData,
    pub visualid: VisualID,
    pub class: ::std::os::raw::c_int,
    pub red_mask: ::std::os::raw::c_ulong,
    pub green_mask: ::std::os::raw::c_ulong,
    pub blue_mask: ::std::os::raw::c_ulong,
    pub bits_per_rgb: ::std::os::raw::c_int,
    pub map_entries: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Visual() {
    assert_eq!(
        ::std::mem::size_of::<Visual>(),
        56usize,
        concat!("Size of: ", stringify!(Visual))
    );
    assert_eq!(
        ::std::mem::align_of::<Visual>(),
        8usize,
        concat!("Alignment of ", stringify!(Visual))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Visual>())).ext_data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Visual),
            "::",
            stringify!(ext_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Visual>())).visualid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Visual),
            "::",
            stringify!(visualid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Visual>())).class as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Visual),
            "::",
            stringify!(class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Visual>())).red_mask as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Visual),
            "::",
            stringify!(red_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Visual>())).green_mask as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Visual),
            "::",
            stringify!(green_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Visual>())).blue_mask as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Visual),
            "::",
            stringify!(blue_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Visual>())).bits_per_rgb as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Visual),
            "::",
            stringify!(bits_per_rgb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Visual>())).map_entries as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Visual),
            "::",
            stringify!(map_entries)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Depth {
    pub depth: ::std::os::raw::c_int,
    pub nvisuals: ::std::os::raw::c_int,
    pub visuals: *mut Visual,
}
#[test]
fn bindgen_test_layout_Depth() {
    assert_eq!(
        ::std::mem::size_of::<Depth>(),
        16usize,
        concat!("Size of: ", stringify!(Depth))
    );
    assert_eq!(
        ::std::mem::align_of::<Depth>(),
        8usize,
        concat!("Alignment of ", stringify!(Depth))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Depth>())).depth as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Depth),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Depth>())).nvisuals as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Depth),
            "::",
            stringify!(nvisuals)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Depth>())).visuals as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Depth),
            "::",
            stringify!(visuals)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XDisplay {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Screen {
    pub ext_data: *mut XExtData,
    pub display: *mut _XDisplay,
    pub root: Window,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub mwidth: ::std::os::raw::c_int,
    pub mheight: ::std::os::raw::c_int,
    pub ndepths: ::std::os::raw::c_int,
    pub depths: *mut Depth,
    pub root_depth: ::std::os::raw::c_int,
    pub root_visual: *mut Visual,
    pub default_gc: GC,
    pub cmap: Colormap,
    pub white_pixel: ::std::os::raw::c_ulong,
    pub black_pixel: ::std::os::raw::c_ulong,
    pub max_maps: ::std::os::raw::c_int,
    pub min_maps: ::std::os::raw::c_int,
    pub backing_store: ::std::os::raw::c_int,
    pub save_unders: ::std::os::raw::c_int,
    pub root_input_mask: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_Screen() {
    assert_eq!(
        ::std::mem::size_of::<Screen>(),
        128usize,
        concat!("Size of: ", stringify!(Screen))
    );
    assert_eq!(
        ::std::mem::align_of::<Screen>(),
        8usize,
        concat!("Alignment of ", stringify!(Screen))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).ext_data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(ext_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).display as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(display)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).root as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(root)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).width as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).height as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).mwidth as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(mwidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).mheight as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(mheight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).ndepths as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(ndepths)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).depths as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(depths)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).root_depth as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(root_depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).root_visual as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(root_visual)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).default_gc as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(default_gc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).cmap as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(cmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).white_pixel as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(white_pixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).black_pixel as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(black_pixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).max_maps as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(max_maps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).min_maps as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(min_maps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).backing_store as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(backing_store)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).save_unders as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(save_unders)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Screen>())).root_input_mask as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(Screen),
            "::",
            stringify!(root_input_mask)
        )
    );
}
pub type Display = _XDisplay;
pub type useconds_t = __useconds_t;
#[doc = " @internal"]
#[doc = " Map character to whatever information we need to be able to send"]
#[doc = " this key (keycode, modifiers, group, etc)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct charcodemap {
    pub key: wchar_t,
    #[doc = " the letter for this key, like 'a'"]
    pub code: KeyCode,
    #[doc = " the keycode that this key is on"]
    pub symbol: KeySym,
    #[doc = " the symbol representing this key"]
    pub group: ::std::os::raw::c_int,
    #[doc = " the keyboard group that has this key in it"]
    pub modmask: ::std::os::raw::c_int,
    #[doc = " the modifiers to apply when sending this key */"]
    #[doc = " exist in the current keymap, this will be set to 1."]
    pub needs_binding: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_charcodemap() {
    assert_eq!(
        ::std::mem::size_of::<charcodemap>(),
        32usize,
        concat!("Size of: ", stringify!(charcodemap))
    );
    assert_eq!(
        ::std::mem::align_of::<charcodemap>(),
        8usize,
        concat!("Alignment of ", stringify!(charcodemap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<charcodemap>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(charcodemap),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<charcodemap>())).code as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(charcodemap),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<charcodemap>())).symbol as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(charcodemap),
            "::",
            stringify!(symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<charcodemap>())).group as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(charcodemap),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<charcodemap>())).modmask as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(charcodemap),
            "::",
            stringify!(modmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<charcodemap>())).needs_binding as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(charcodemap),
            "::",
            stringify!(needs_binding)
        )
    );
}
#[doc = " @internal"]
#[doc = " Map character to whatever information we need to be able to send"]
#[doc = " this key (keycode, modifiers, group, etc)"]
pub type charcodemap_t = charcodemap;
#[doc = " The main context."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xdo {
    #[doc = " The Display for Xlib"]
    pub xdpy: *mut Display,
    #[doc = " The display name, if any. NULL if not specified."]
    pub display_name: *mut ::std::os::raw::c_char,
    #[doc = " @internal Array of known keys/characters"]
    pub charcodes: *mut charcodemap_t,
    #[doc = " @internal Length of charcodes array"]
    pub charcodes_len: ::std::os::raw::c_int,
    #[doc = " @internal highest keycode value"]
    pub keycode_high: ::std::os::raw::c_int,
    #[doc = " @internal lowest keycode value"]
    pub keycode_low: ::std::os::raw::c_int,
    #[doc = " @internal number of keysyms per keycode"]
    pub keysyms_per_keycode: ::std::os::raw::c_int,
    #[doc = " Should we close the display when calling xdo_free?"]
    pub close_display_when_freed: ::std::os::raw::c_int,
    #[doc = " Be extra quiet? (omits some error/message output)"]
    pub quiet: ::std::os::raw::c_int,
    #[doc = " Enable debug output?"]
    pub debug: ::std::os::raw::c_int,
    #[doc = " Feature flags, such as XDO_FEATURE_XTEST, etc..."]
    pub features_mask: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xdo() {
    assert_eq!(
        ::std::mem::size_of::<xdo>(),
        56usize,
        concat!("Size of: ", stringify!(xdo))
    );
    assert_eq!(
        ::std::mem::align_of::<xdo>(),
        8usize,
        concat!("Alignment of ", stringify!(xdo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).xdpy as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xdo), "::", stringify!(xdpy))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).display_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo),
            "::",
            stringify!(display_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).charcodes as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo),
            "::",
            stringify!(charcodes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).charcodes_len as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo),
            "::",
            stringify!(charcodes_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).keycode_high as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo),
            "::",
            stringify!(keycode_high)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).keycode_low as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo),
            "::",
            stringify!(keycode_low)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).keysyms_per_keycode as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo),
            "::",
            stringify!(keysyms_per_keycode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).close_display_when_freed as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo),
            "::",
            stringify!(close_display_when_freed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).quiet as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo),
            "::",
            stringify!(quiet)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).debug as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo>())).features_mask as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo),
            "::",
            stringify!(features_mask)
        )
    );
}
#[doc = " The main context."]
pub type xdo_t = xdo;
#[doc = " The window search query structure."]
#[doc = ""]
#[doc = " @see xdo_search_windows"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xdo_search {
    pub title: *const ::std::os::raw::c_char,
    #[doc = " pattern to test against a window title"]
    pub winclass: *const ::std::os::raw::c_char,
    #[doc = " pattern to test against a window class"]
    pub winclassname: *const ::std::os::raw::c_char,
    #[doc = " pattern to test against a window class"]
    pub winname: *const ::std::os::raw::c_char,
    #[doc = " pattern to test against a window name"]
    pub winrole: *const ::std::os::raw::c_char,
    #[doc = " pattern to test against a window role"]
    pub pid: ::std::os::raw::c_int,
    #[doc = " window pid (From window atom _NET_WM_PID)"]
    pub max_depth: ::std::os::raw::c_long,
    #[doc = " depth of search. 1 means only toplevel windows"]
    pub only_visible: ::std::os::raw::c_int,
    #[doc = " boolean; set true to search only visible windows"]
    pub screen: ::std::os::raw::c_int,
    pub require: xdo_search__bindgen_ty_1,
    #[doc = " bitmask of things you are searching for, such as SEARCH_NAME, etc."]
    #[doc = " @see SEARCH_NAME, SEARCH_CLASS, SEARCH_PID, SEARCH_CLASSNAME, etc"]
    pub searchmask: ::std::os::raw::c_uint,
    #[doc = " What desktop to search, if any. If none given, search all screens."]
    pub desktop: ::std::os::raw::c_long,
    #[doc = " How many results to return? If 0, return all."]
    pub limit: ::std::os::raw::c_uint,
}
pub const xdo_search_SEARCH_ANY: ::std::os::raw::c_uint = 0;
pub const xdo_search_SEARCH_ALL: ::std::os::raw::c_uint = 1;
#[doc = " Should the tests be 'and' or 'or' ? If 'and', any failure will skip the"]
#[doc = " window. If 'or', any success will keep the window in search results."]
pub type xdo_search__bindgen_ty_1 = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_xdo_search() {
    assert_eq!(
        ::std::mem::size_of::<xdo_search>(),
        88usize,
        concat!("Size of: ", stringify!(xdo_search))
    );
    assert_eq!(
        ::std::mem::align_of::<xdo_search>(),
        8usize,
        concat!("Alignment of ", stringify!(xdo_search))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).title as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(title)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).winclass as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(winclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).winclassname as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(winclassname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).winname as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(winname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).winrole as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(winrole)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).pid as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).max_depth as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(max_depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).only_visible as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(only_visible)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).screen as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(screen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).require as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(require)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).searchmask as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(searchmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).desktop as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(desktop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xdo_search>())).limit as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(xdo_search),
            "::",
            stringify!(limit)
        )
    );
}
#[doc = " The window search query structure."]
#[doc = ""]
#[doc = " @see xdo_search_windows"]
pub type xdo_search_t = xdo_search;
extern "C" {
    #[doc = " Create a new xdo_t instance."]
    #[doc = ""]
    #[doc = " @param display the string display name, such as \":0\". If null, uses the"]
    #[doc = " environment variable DISPLAY just like XOpenDisplay(NULL)."]
    #[doc = ""]
    #[doc = " @return Pointer to a new xdo_t or NULL on failure"]
    pub fn xdo_new(display: *const ::std::os::raw::c_char) -> *mut xdo_t;
}
extern "C" {
    #[doc = " Create a new xdo_t instance with an existing X11 Display instance."]
    #[doc = ""]
    #[doc = " @param xdpy the Display pointer given by a previous XOpenDisplay()"]
    #[doc = " @param display the string display name"]
    #[doc = " @param close_display_when_freed If true, we will close the display when"]
